Revit 2027 API
IFCFile.GetInstances Method
 Gets IFC instances of one particular type.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<IFCAnyHandle> GetInstances(
	string entityName,
	bool includeSubTypes
)
Public Function GetInstances (
	entityName As String,
	includeSubTypes As Boolean
) As IList(Of IFCAnyHandle)
public:
IList<IFCAnyHandle^>^ GetInstances(
	String^ entityName,
	bool includeSubTypes
)
member GetInstances :
        entityName : string *
        includeSubTypes : bool -> IList<IFCAnyHandle>
Parameters
entityName String
 The name of the instance type.
includeSubTypes Boolean
 True to retrieve instances of sub types.
Return Value
IList<IFCAnyHandle>
 The instance handles.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCFile Class
Autodesk.Revit.DB.IFC Namespace